#!/bin/bash
# Скрипт для тестирования программы dirwalk

clear

echo "----------------------------------------------------"
echo "Тест 1: Проверка без каких-либо опций"
echo "----------------------------------------------------"
out/release/dirwalk test/
echo ""
echo "----------------------------------------------------"
echo "Тест 2: Вывод только файлов (-f)"
echo "----------------------------------------------------"
out/release/dirwalk test/ -f
echo ""
echo "----------------------------------------------------"
echo "Тест 3: Вывод только каталогов (-d)"
echo "----------------------------------------------------"
out/release/dirwalk test/ -d
echo ""
echo "----------------------------------------------------"
echo "Тест 4: Вывод только символических ссылок (-l)"
echo "----------------------------------------------------"
out/release/dirwalk test/ -l
echo ""
echo "----------------------------------------------------"
echo "Тест 5: Сортировка вывода (-s)"
echo "----------------------------------------------------"
out/release/dirwalk test/ -s
echo ""
echo "----------------------------------------------------"
echo "Тест 6: Комбинированный запуск (-f -l -s)"
echo "----------------------------------------------------"
out/release/dirwalk test/ -f -l -s
echo ""

echo "Тестирование завершено."
